tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
void FarmDoorApp::handleSetPosition() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const DoorSnapshot before = g_door.snapshot();
  DoorCommandResult result = DoorCommandResult::InvalidArgument;
  char position[16];
  if (Esp32BaseWeb::getParam("position", position, sizeof(position))) {
    if (strcmp(position, "closed") == 0 || strcmp(position, "Closed") == 0) {
      if (!requireConfirm("set-position", "position:closed")) {
        return;
      }
      const uint32_t commandId = allocateCommandId();
      result = g_door.markPositionClosed();
      DoorRecord record;
      record.commandId = commandId;
      record.type = DoorRecordType::PositionSet;
      record.result = doorRecordResultFromCommand(result);
      record.oldPositionPulses = before.positionPulses;
      record.newPositionPulses = g_door.snapshot().positionPulses;
      recordBusinessEvent(record);
      if (result == DoorCommandResult::Ok) {
        if (g_motorOutputReady) {
          g_motorEncoder.resetPosition(g_door.snapshot().positionPulses);
          g_motor.setCurrentPositionPulses(g_door.snapshot().positionPulses);
        }
        persistDoorRecoveryStateIfReady();
      }
      sendCommandResultJson(result, commandId);
      return;
    }
    if (strcmp(position, "open") == 0 || strcmp(position, "Open") == 0) {
      if (!requireConfirm("set-position", "position:open")) {
        return;
      }
      const uint32_t commandId = allocateCommandId();
      result = g_door.markPositionOpen();
      DoorRecord record;
      record.commandId = commandId;
      record.type = DoorRecordType::PositionSet;
      record.result = doorRecordResultFromCommand(result);
      record.oldPositionPulses = before.positionPulses;
      record.newPositionPulses = g_door.snapshot().positionPulses;
      recordBusinessEvent(record);
      if (result == DoorCommandResult::Ok) {
        if (g_motorOutputReady) {
          g_motorEncoder.resetPosition(g_door.snapshot().positionPulses);
          g_motor.setCurrentPositionPulses(g_door.snapshot().positionPulses);
        }
        persistDoorRecoveryStateIfReady();
      }
      sendCommandResultJson(result, commandId);
      return;
    }
    if (strcmp(position, "unknown") == 0 || strcmp(position, "Unknown") == 0) {
      if (!requireConfirm("set-position", "position:unknown")) {
        return;
      }
      const uint32_t commandId = allocateCommandId();
      result = g_door.setTrustedPosition(0, PositionTrustLevel::Untrusted);
      DoorRecord record;
      record.commandId = commandId;
      record.type = DoorRecordType::PositionSet;
      record.result = doorRecordResultFromCommand(result);
      record.oldPositionPulses = before.positionPulses;
      record.newPositionPulses = g_door.snapshot().positionPulses;
      recordBusinessEvent(record);
      if (result == DoorCommandResult::Ok) {
        if (g_motorOutputReady) {
          g_motorEncoder.resetPosition(g_door.snapshot().positionPulses);
          g_motor.setCurrentPositionPulses(g_door.snapshot().positionPulses);
        }
        persistDoorRecoveryStateIfReady();
      }
      sendCommandResultJson(result, commandId);
      return;
    }
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }

  int64_t positionPulses = 0;
  PositionTrustLevel trustLevel = PositionTrustLevel::Trusted;
  if (!readInt64Param("positionPulses", positionPulses) || !readTrustLevelParam(trustLevel)) {
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "positionPulses:%lld",
           static_cast<long long>(positionPulses));
  if (!requireConfirm("set-position", resource)) {
    return;
  }
  const uint32_t commandId = allocateCommandId();
  result = g_door.setTrustedPosition(positionPulses, trustLevel);
  DoorRecord record;
  record.commandId = commandId;
  record.type = DoorRecordType::PositionSet;
  record.result = doorRecordResultFromCommand(result);
  record.oldPositionPulses = before.positionPulses;
  record.newPositionPulses = g_door.snapshot().positionPulses;
  recordBusinessEvent(record);
  if (result == DoorCommandResult::Ok) {
    if (g_motorOutputReady) {
      g_motorEncoder.resetPosition(g_door.snapshot().positionPulses);
      g_motor.setCurrentPositionPulses(g_door.snapshot().positionPulses);
    }
    persistDoorRecoveryStateIfReady();
  }
  sendCommandResultJson(result, commandId);
#endif
}

void FarmDoorApp::handleSetTravel() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  int64_t openTargetPulses = 0;
  int64_t openTurnsX100 = 0;
  const bool hasPulses = hasParam("openTargetPulses");
  const bool hasTurns = hasParam("openTurnsX100");
  if (hasPulses) {
    if (!readInt64Param("openTargetPulses", openTargetPulses)) {
      sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
      return;
    }
  } else if (hasTurns) {
    if (!readInt64Param("openTurnsX100", openTurnsX100)) {
      sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
      return;
    }
    openTargetPulses = openTargetPulsesFromTurnsX100(openTurnsX100);
  } else {
    sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
    return;
  }

  int64_t maxRunPulses = defaultMaxRunPulsesForTarget(openTargetPulses);
  if (!readInt64ParamOptional("maxRunPulses", maxRunPulses)) {
    sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "travel:%lld",
           static_cast<long long>(openTargetPulses));
  if (!requireConfirm("set-travel", resource)) {
    return;
  }

  const uint32_t commandId = allocateCommandId();
  bool configSaved = false;
  const int64_t oldTravelPulses = g_door.snapshot().openTargetPulses;
  const DoorCommandResult result = applyTravelUpdate(openTargetPulses, maxRunPulses, configSaved);
  DoorRecord record;
  record.commandId = commandId;
  record.type = DoorRecordType::TravelSet;
  record.result = doorRecordResultFromCommand(result);
  record.oldTravelPulses = oldTravelPulses;
  record.newTravelPulses = g_door.snapshot().openTargetPulses;
  record.deltaPulses = record.newTravelPulses - record.oldTravelPulses;
  recordBusinessEvent(record);
  if (result == DoorCommandResult::Ok) {
    persistDoorRecoveryStateIfReady();
  }
  sendTravelResultJson(result, configSaved, commandId);
#endif
}

