tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
void FarmDoorApp::handleAdjustTravel() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  int64_t deltaPulses = 0;
  int64_t deltaTurnsX100 = 0;
  const bool hasDeltaPulses = hasParam("deltaPulses");
  const bool hasDeltaTurns = hasParam("deltaTurnsX100");
  if (hasDeltaPulses) {
    if (!readInt64Param("deltaPulses", deltaPulses)) {
      sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
      return;
    }
  } else if (hasDeltaTurns) {
    if (!readInt64Param("deltaTurnsX100", deltaTurnsX100)) {
      sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
      return;
    }
    deltaPulses = openTargetPulsesFromTurnsX100(deltaTurnsX100);
  } else {
    sendTravelResultJson(DoorCommandResult::InvalidArgument, false);
    return;
  }

  const int64_t openTargetPulses = g_door.snapshot().openTargetPulses + deltaPulses;
  const int64_t maxRunPulses = defaultMaxRunPulsesForTarget(openTargetPulses);
  char resource[40];
  snprintf(resource, sizeof(resource), "adjust:%lld",
           static_cast<long long>(deltaPulses));
  if (!requireConfirm("adjust-travel", resource)) {
    return;
  }
  const uint32_t commandId = allocateCommandId();
  bool configSaved = false;
  const int64_t oldTravelPulses = g_door.snapshot().openTargetPulses;
  const DoorCommandResult result = applyTravelUpdate(openTargetPulses, maxRunPulses, configSaved);
  DoorRecord record;
  record.commandId = commandId;
  record.type = DoorRecordType::TravelAdjusted;
  record.result = doorRecordResultFromCommand(result);
  record.oldTravelPulses = oldTravelPulses;
  record.newTravelPulses = g_door.snapshot().openTargetPulses;
  record.deltaPulses = deltaPulses;
  recordBusinessEvent(record);
  if (result == DoorCommandResult::Ok) {
    persistDoorRecoveryStateIfReady();
  }
  sendTravelResultJson(result, configSaved, commandId);
#endif
}

void FarmDoorApp::handleClearFault() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  if (!requireConfirm("clear-fault", "door")) {
    return;
  }
  const uint32_t commandId = allocateCommandId();
  const DoorSnapshot before = g_door.snapshot();
  const DoorCommandResult result = g_door.clearFault();
  DoorRecord record;
  record.commandId = commandId;
  record.type = DoorRecordType::FaultCleared;
  record.result = doorRecordResultFromCommand(result);
  recordBusinessEvent(record);
  if (result == DoorCommandResult::Ok) {
    FarmAutoEventLog::recordDoorFaultCleared(faultReasonName(before.faultReason));
  }
  sendCommandResultJson(result, commandId);
#endif
}
